donginhb/yeejoin-workspace/light-300/rs485-sw/os-app/bsp/stm32f10x/board.c
/*
 * File      : board.c
 * This file is part of RT-Thread RTOS
 * COPYRIGHT (C) 2009 RT-Thread Develop Team
 *
 * The license and distribution terms for this file may be
 * found in the file LICENSE in this distribution or at
 * http://www.rt-thread.org/license/LICENSE
 *
 * Change Logs:
 * Date           Author       Notes
 * 2009-01-05     Bernard      first implementation
 */

#include <rthw.h>
#include <rtthread.h>

#include <stm32f10x.h>
#include <stm32f10x_fsmc.h>
#include "board.h"
#include <stm32f10x_wwdg.h>


static void RCC_Configuration(void);
static void GPIO_Configuration(void);
static void NVIC_Configuration(void);
static void exti_config(void);
static void spi_config(void);

#if ENABLE_RAND
static void ADC_Configration(void);
static void ADC_Channel_Config(void);
#endif

void i2c_config(void);

//static void sys_fsmc_nor_mux_config(void);
#if 1==STM32_USE_FSMC_NOR_MUX2LCD
static void lcd_fsmc_nor_mux_config(void);
#endif

#if USE_STM32_IWDG
static void iwdg_init(void);
#endif


#if 0
#define board_debug(x)	rt_kprintf x
#else
#define board_debug(x)
#endif


#if RT_USING_STM32_FSMC
static void fsmc_cfg(void);
#endif

#if EM_MULTI_BASE
static void decoder_pins_cfg(void);
static void double_mbus_indication_pins_cfg(void);
#endif

#if RT_USING_TL16C554
static void tl16c554_pins_cfg(void);
#endif

//void delay_us(int xus);

/**
 * @addtogroup STM32
 */

/*@{*/


/**
 * This function will initial STM32 board.
 */
void rt_hw_board_init()
{
	RCC_Configuration();
	GPIO_Configuration();

#if RT_USING_STM32_FSMC
	fsmc_cfg();
#endif


	NVIC_Configuration();

	/* Configure the SysTick */
	SysTick_Config( SystemCoreClock / RT_TICK_PER_SECOND );

	/* rand */
#if ENABLE_RAND
	ADC_Configration();
	ADC_Channel_Config();
#endif


	rt_hw_usart_init();
	rt_console_set_device(CONSOLE_DEVICE);

	board_debug(("func:%s(), line:%d\n", __FUNCTION__, __LINE__));

	exti_config(); /* mark by David */

	spi_config();

	board_debug(("func:%s(), line:%d\n", __FUNCTION__, __LINE__));

#if USE_STM32_IWDG
	iwdg_init();
#endif
	board_debug(("func:%s(), line:%d\n", __FUNCTION__, __LINE__));


	return;
}

#if USE_STM32_IWDG
/*
 * These timings are given for a 40 kHz clock but the microcontroller's internal RC frequency can vary
 * from 30 to 60 kHz.
 * t0 = 1/f40 * cnt / pre_div
 * t1 = 1/f30 * cnt / pre_div = 4/3 * t0
 * t2 = 1/f60 * cnt / pre_div = 2/3 * t0
 *
 * Prescaler divider 	PR[2:0] bits 	Min timeout (ms) RL[11:0]=0x000 	Max timeout (ms) RL[11:0]=0xFFF
 * /4 			0 		0.1 					409.6
 */

/*
 * t = (reload_val + 1) * 1/f40 / pre_div
 *
 * t0(ms)	t1(ms)	t2(ms)
 * 0.1		0.13	0.067
 * 409.6	546.13	273.07
 * 100(0x3e7)	133.3   66.67
 *
 * 30(0x12b)	40	20
 * 90(0x383)	120	60
 *
 * IWDG_RELOAD_VALUE -- max 0xfff
 *
 * t0 = 1220ms, 256分频, 191(0xbf)
 * 0xbf * 9 = 0x6B7
 */
#if EM_MULTI_BASE
#define IWDG_RELOAD_VALUE (0xbf*2)
#else
#define IWDG_RELOAD_VALUE (0xbf)
#endif

static void iwdg_init(void)
{
	IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable);

	IWDG_SetPrescaler(IWDG_Prescaler_256);
	IWDG_SetReload(IWDG_RELOAD_VALUE);
#if 0
	rt_kprintf("IWDG->SR:0x%x\n", IWDG->SR);
	/* 在没有iwdg没有enable时, 状态标志可能不会更新, ysh>>IWDG->SR:0x3 */
	while (SET==IWDG_GetFlagStatus(IWDG_FLAG_PVU))
		; /* nothing, 等待寄存器更新完成 */
	while (SET==IWDG_GetFlagStatus(IWDG_FLAG_RVU))
		; /* nothing, 等待寄存器更新完成 */
#endif
	/* 禁止更新寄存器应该只是禁止软件来更新, 不会停止正在进行的更新(由硬件正在进行的更新) */
	IWDG_WriteAccessCmd(IWDG_WriteAccess_Disable);

	/* IWDG_Enable(); 延迟开启看门狗 */
	return;
}
#endif


/**
 * This is the timer interrupt service routine.
 *
 */
void rt_hw_timer_handler(void)
{
	/* enter interrupt */
	rt_interrupt_enter();

#if 0 //USE_STM32_IWDG
	/* Reloads IWDG counter with value defined in the reload register */
	/* #define KR_KEY_Reload    ((uint16_t)0xAAAA) */
	IWDG->KR = 0xAAAA;
#endif

#if USE_STM32_WWDG
	extern volatile int is_need_fed_wwdg;
	if (0 != is_need_fed_wwdg)
		WWDG->CR = WWDG_RELOAD_VALUE;
#endif

	rt_tick_increase();

#ifdef RT_USING_LWIP
	extern void snmp_inc_sysuptime(void);
	snmp_inc_sysuptime();
#endif

	/* leave interrupt */
	rt_interrupt_leave();
}


static void RCC_Configuration(void)
{
	uint32_t gpio_rcc = 0;

#if RT_EXT_SRAM_MULTIPLEXED
	gpio_rcc = RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOB | RCC_APB2Periph_GPIOC |
			   RCC_APB2Periph_GPIOD | RCC_APB2Periph_GPIOE;
#else
	gpio_rcc = RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOB | RCC_APB2Periph_GPIOC |
			   RCC_APB2Periph_GPIOD | RCC_APB2Periph_GPIOE | RCC_APB2Periph_GPIOF
			   | RCC_APB2Periph_GPIOG;
#endif
	RCC_APB2PeriphClockCmd(gpio_rcc, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);

	GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable, ENABLE);

	/* Enable SPI1 GPIOB clocks, sst25vf016b */
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_SPI1, ENABLE);
	/* Enable SPI2 clocks, enc28j60 */
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI2, ENABLE);

	/* use for ade7880 i2c */
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_I2C2, ENABLE);  
	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA2, ENABLE);

	/* si4432 */
	/* use for ade7880 */
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI3, ENABLE);
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2 | RCC_APB1Periph_TIM3, ENABLE);

#if ENABLE_RAND
	/* stm32 temperature */
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1,ENABLE);
#endif

	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_FSMC, ENABLE);

	/*
	* USART
	*/
#ifdef RT_USING_UART1
	/* Enable USART1 and GPIOA clocks */
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);

#if RT_USE_UART1_REMAP
	GPIO_PinRemapConfig(GPIO_Remap_USART1, ENABLE);
#endif
#endif

#ifdef RT_USING_UART2
#if 1==RT_USE_UART2_REMAP
	/* Enable the USART2 Pins Software Remapping */
	GPIO_PinRemapConfig(GPIO_Remap_USART2, ENABLE);
#endif
	/* Enable USART2 clock */
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);
#endif


//#ifdef RT_USING_UART3	/* 串口3会影响I2C????????? */
#if 0
	/* Enable USART3 clock */
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE);
#if RT_UART3_USE_DMA
	/* DMA clock enable */
	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
#endif
#endif

#ifdef RT_USING_UART4
	/* Enable UART4 clock */
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART4, ENABLE);
#if RT_UART4_USE_DMA
	/* DMA clock enable */
	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA2, ENABLE);
#endif
#endif

