donginhb/yeejoin-workspace/light-300/rs485-sw/os-app/bsp/stm32f10x/board.c
#ifdef RT_USING_UART5
	/* Enable UART5 clock */
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART5, ENABLE);
#endif
#if 1
	/* Enable PWR and BKP clocks */
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR | RCC_APB1Periph_BKP, ENABLE);
#endif
}



static void uart_pins_cfg(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;

#ifdef RT_USING_UART1
	/* Configure USART1 Rx (PA.10) as input floating */
	GPIO_InitStructure.GPIO_Pin = UART1_GPIO_RX;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_Init(UART1_GPIO, &GPIO_InitStructure);

	/* Configure USART1 Tx (PA.09) as alternate function push-pull */
	GPIO_InitStructure.GPIO_Pin = UART1_GPIO_TX;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_Init(UART1_GPIO, &GPIO_InitStructure);
#endif

#ifdef RT_USING_UART2
	/* Configure USART2 Rx as input floating */
	GPIO_InitStructure.GPIO_Pin = UART2_GPIO_RX;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_Init(UART2_GPIO, &GPIO_InitStructure);

	/* Configure USART2 Tx as alternate function push-pull */
	GPIO_InitStructure.GPIO_Pin = UART2_GPIO_TX;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(UART2_GPIO, &GPIO_InitStructure);
#endif

#ifdef RT_USING_UART3
	/* Configure USART3 Rx as input floating */
	GPIO_InitStructure.GPIO_Pin = UART3_GPIO_RX;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_Init(UART3_GPIO, &GPIO_InitStructure);

	/* Configure USART3 Tx as alternate function push-pull */
	GPIO_InitStructure.GPIO_Pin = UART3_GPIO_TX;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(UART3_GPIO, &GPIO_InitStructure);
#endif

#ifdef RT_USING_UART4
	/* Configure UART4 Rx as input floating */
	GPIO_InitStructure.GPIO_Pin = UART4_GPIO_RX;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_Init(UART4_GPIO, &GPIO_InitStructure);

	/* Configure USART4 Tx as alternate function push-pull */
	GPIO_InitStructure.GPIO_Pin = UART4_GPIO_TX;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(UART4_GPIO, &GPIO_InitStructure);
#endif

#ifdef RT_USING_UART5
	/* Configure UART5 Rx as input floating */
	GPIO_InitStructure.GPIO_Pin = UART5_GPIO_RX;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_Init(UART5_GPIO_RX_PORT, &GPIO_InitStructure);

	/* Configure USART5 Tx as alternate function push-pull */
	GPIO_InitStructure.GPIO_Pin = UART5_GPIO_TX;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(UART5_GPIO_TX_PORT, &GPIO_InitStructure);
#endif
}

/*
 *  PERIPHERALS	MODES	REMAP	FUNCTIONS	PINS
 *  SPI1	Mode	0	SPI1_MISO	PA6
 *  SPI1	Mode	0	SPI1_MOSI	PA7
 *  SPI1	Mode	0	SPI1_SCK	PA5
 *  USART1	Mode	0	USART1_RX	PA10
 *  USART1	Mode	0	USART1_TX	PA9
 */
/*
 * CPU中所对应SD卡接口	SD卡接口
 * 引脚号	管脚		注释	引脚号		注释	备注
 * 78	PC10		SDIO-D2	1		PC10-SDIO-D2
 * 79	PC11		SDIO-D3	2		PC11-SDIO-D3
 * 83	PD2		SDIO-CMD	3		PD2-SDIO-CMD
 * 80	PC12		SDIO-CK	5		PC12-SDIO-CK
 * 65	PC8		SDIO-D0	7		PC8-SDIO-D0
 * 66	PC9		SDIO-D1	8		PC9-SDIO-D1
 */
static void GPIO_Configuration(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;

	uart_pins_cfg();

	/* led */
#if EM_MULTI_BASE
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin   = led1_pin;
	GPIO_Init(led1_gpio, &GPIO_InitStructure);

	GPIO_InitStructure.GPIO_Pin   = led2_pin;
	GPIO_Init(led2_gpio, &GPIO_InitStructure);

	led_off(led1_gpio, led1_pin);
	led_off(led2_gpio, led2_pin);

	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin   = s2p_74hc164_clk_pin;
	GPIO_Init(s2p_74hc164_clk_gpio, &GPIO_InitStructure);
	clr_port_pin(s2p_74hc164_clk_gpio, s2p_74hc164_clk_pin);

	GPIO_InitStructure.GPIO_Pin   = s2p_74hc164_data_pin;
	GPIO_Init(s2p_74hc164_data_gpio, &GPIO_InitStructure);
	clr_port_pin(s2p_74hc164_data_gpio, s2p_74hc164_data_pin);

	decoder_pins_cfg();
	double_mbus_indication_pins_cfg();

	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin   = ade7880_range_switch_pin;
	GPIO_Init(ade7880_range_switch_gpio, &GPIO_InitStructure);
	//set_7880_to_lagre_scale();
	set_7880_to_small_scale();      
#else
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin   = led1_pin;
	GPIO_Init(led1_gpio, &GPIO_InitStructure);

	GPIO_InitStructure.GPIO_Pin   = led2_pin;
	GPIO_Init(led2_gpio, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin   = led3_pin;
	GPIO_Init(led3_gpio, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin   = led4_pin;
	GPIO_Init(led4_gpio, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin   = led5_pin;
	GPIO_Init(led5_gpio, &GPIO_InitStructure);

	led_off(led1_gpio, led1_pin);
	led_off(led2_gpio, led2_pin);
	led_off(led3_gpio, led3_pin);
	led_off(led4_gpio, led4_pin);
	led_off(led5_gpio, led5_pin);
#endif

#if 0	/* buzzer */
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin   = buzzer_pin;
	GPIO_Init(buzzer_gpio, &GPIO_InitStructure);
#endif

	/* 485en-1 */
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin   = driver_oen_485_1_pin;
	GPIO_Init(driver_oen_485_1_gpio, &GPIO_InitStructure);
	tx_disable_rev_en_485_1();

	/* 485en-2 */
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin   = driver_oen_485_2_pin;
	GPIO_Init(driver_oen_485_2_gpio, &GPIO_InitStructure);
	tx_disable_rev_en_485_2();

	/* 485en-3 */
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin   = driver_oen_485_3_pin;
	GPIO_Init(driver_oen_485_3_gpio, &GPIO_InitStructure);
	tx_disable_rev_en_485_3();

#if RT_USING_ENC28J60 /* ENC28J60 */
	/*
	 * stm32f103ve使用SPI2与ENC28J60连接
	 * NSS	-- PB12
	 * SCK	-- PB13
	 * MISO	-- PB14
	 * MOSI	-- PB15
	 *
	 * ENC28J60的/int引脚连接至stm32f103ve的PA8
	 * ENC28J60的/RST引脚连接至stm32f103ve的PC6
	 *
	 * ENC28J60的/int引脚连接至stm32f103ve的PB10
	 * ENC28J60的/RST引脚连接至stm32f103ve的PB11
	 */

	/* Configure SPI pins: SCK, MISO and MOSI */
	GPIO_InitStructure.GPIO_Pin 	= ENC28J60_SPI_SCK | ENC28J60_SPI_MISO | ENC28J60_SPI_MOSI;
	GPIO_InitStructure.GPIO_Speed 	= GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode	= GPIO_Mode_AF_PP;
	GPIO_Init(ENC28J60_SPI_PORT, &GPIO_InitStructure);

	/* (ENC28J60_CS_PORT, ENC28J60_CS_PIN), Configure SPI2 pin: NSS */
	GPIO_InitStructure.GPIO_Pin 	= ENC28J60_SPI_NSS;
	GPIO_InitStructure.GPIO_Speed 	= GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode 	= GPIO_Mode_Out_PP;
	GPIO_Init(ENC28J60_SPI_NSS_PORT, &GPIO_InitStructure);
	GPIO_SetBits(ENC28J60_SPI_NSS_PORT, ENC28J60_SPI_NSS);

	/* /int */
	GPIO_InitStructure.GPIO_Pin 	= ENC28J60_INT_PIN;
	GPIO_InitStructure.GPIO_Speed 	= GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode 	= GPIO_Mode_IN_FLOATING;
	GPIO_Init(ENC28J60_INT_PORT, &GPIO_InitStructure);

	/* /rst */
	GPIO_InitStructure.GPIO_Pin 	= ENC28J60_RST_PIN;
	GPIO_InitStructure.GPIO_Speed 	= GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode 	= GPIO_Mode_Out_PP;
	GPIO_Init(ENC28J60_RST_PORT, &GPIO_InitStructure);
	GPIO_SetBits(ENC28J60_RST_PORT, ENC28J60_RST_PIN);
#endif
#if RT_USING_SERIAL_FLASH /* spi flash */
	/* Configure SPI pins: SCK, MISO and MOSI */
	GPIO_InitStructure.GPIO_Pin 	= SF_SPI_SCK | SF_SPI_MISO | SF_SPI_MOSI;
	GPIO_InitStructure.GPIO_Speed 	= GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode	= GPIO_Mode_AF_PP;
	GPIO_Init(SF_SPI_PORT, &GPIO_InitStructure);

	/* (SF_CS_PORT, SF_CS_PIN), Configure SPI2 pin: NSS */
	GPIO_InitStructure.GPIO_Pin 	= SF_SPI_NSS;
	GPIO_InitStructure.GPIO_Speed 	= GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode 	= GPIO_Mode_Out_PP;
	GPIO_Init(SF_SPI_NSS_PORT, &GPIO_InitStructure);
	GPIO_SetBits(SF_SPI_NSS_PORT, SF_SPI_NSS);

	/* /hold */
	GPIO_InitStructure.GPIO_Pin 	= SF_HOLD_PIN ;
	GPIO_InitStructure.GPIO_Speed 	= GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode 	= GPIO_Mode_Out_PP;
	GPIO_Init(SF_HOLD_PORT, &GPIO_InitStructure);
	GPIO_SetBits(SF_HOLD_PORT, SF_HOLD_PIN);

	/* /wp */
	GPIO_InitStructure.GPIO_Pin 	= SF_WP_PIN;
	GPIO_InitStructure.GPIO_Speed 	= GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode 	= GPIO_Mode_Out_PP;
	GPIO_Init(SF_WP_PORT, &GPIO_InitStructure);
	GPIO_SetBits(SF_WP_PORT, SF_WP_PIN);
#endif

#if RT_USING_TL16C554
	tl16c554_pins_cfg();
#endif
}

