donginhb/yeejoin-workspace/light-300/rs485-sw/os-app/bsp/stm32f10x/board.c
	/* Enable FSMC Bank1_SRAM Bank */
	FSMC_NORSRAMCmd(FSMC_Bank1_NORSRAM1, ENABLE);
}

#else /* STM32_EXT_SRAM */

static void fsmc_for_tl16c554_cfg(void)
{

	FSMC_NORSRAMInitTypeDef  	FSMC_NORSRAMInitStructure;
	FSMC_NORSRAMTimingInitTypeDef  	timing;

	FSMC_NORSRAMDeInit(FSMC_Bank1_NORSRAM1);

	/*
	 * ---- 初期调试用参数
	 * p.FSMC_AddressSetupTime = 15;
	 * p.FSMC_AddressHoldTime = 15;
	 * p.FSMC_DataSetupTime = 15;
	 * p.FSMC_BusTurnAroundDuration = 15;
	 * p.FSMC_CLKDivision = 8;
	 * p.FSMC_DataLatency = 15;
	 */
	timing.FSMC_AddressSetupTime 	  = 0x02; /* It is not used with synchronous NOR Flash memories. */
	timing.FSMC_AddressHoldTime 	  = 0x05; /* It is not used with synchronous NOR Flash memories.*/
	timing.FSMC_DataSetupTime 	  = 0x03; /* It is used for SRAMs, ROMs and asynchronous multiplexed NOR Flash memories. */
	timing.FSMC_BusTurnAroundDuration = 0x00; /* It is only used for multiplexed NOR Flash memories. */

	timing.FSMC_CLKDivision		  = 0x00; /* It is not used for asynchronous NOR Flash, SRAM or ROM accesses. */
	timing.FSMC_DataLatency		  = 0x00; /* It must be set to 0 in case of a CRAM */

	timing.FSMC_AccessMode		  = FSMC_AccessMode_A;

	FSMC_NORSRAMInitStructure.FSMC_Bank 		  = FSMC_Bank1_NORSRAM1;
#if RT_EXT_SRAM_MULTIPLEXED
	FSMC_NORSRAMInitStructure.FSMC_DataAddressMux 	  = FSMC_DataAddressMux_Enable;
#else
	FSMC_NORSRAMInitStructure.FSMC_DataAddressMux 	  = FSMC_DataAddressMux_Disable;
#endif
	FSMC_NORSRAMInitStructure.FSMC_MemoryType 	  = FSMC_MemoryType_PSRAM;
	FSMC_NORSRAMInitStructure.FSMC_MemoryDataWidth 	  = FSMC_MemoryDataWidth_8b;
	FSMC_NORSRAMInitStructure.FSMC_BurstAccessMode 	  = FSMC_BurstAccessMode_Disable;
	FSMC_NORSRAMInitStructure.FSMC_AsynchronousWait   = FSMC_AsynchronousWait_Disable;
	FSMC_NORSRAMInitStructure.FSMC_WaitSignalPolarity = FSMC_WaitSignalPolarity_Low;
	FSMC_NORSRAMInitStructure.FSMC_WrapMode 	  = FSMC_WrapMode_Disable;
	FSMC_NORSRAMInitStructure.FSMC_WaitSignalActive   = FSMC_WaitSignalActive_BeforeWaitState;
	FSMC_NORSRAMInitStructure.FSMC_WriteOperation 	  = FSMC_WriteOperation_Enable;
	FSMC_NORSRAMInitStructure.FSMC_WaitSignal 	  = FSMC_WaitSignal_Disable;
	FSMC_NORSRAMInitStructure.FSMC_ExtendedMode 	  = FSMC_ExtendedMode_Disable;
	FSMC_NORSRAMInitStructure.FSMC_WriteBurst 	  = FSMC_WriteBurst_Disable;

	FSMC_NORSRAMInitStructure.FSMC_ReadWriteTimingStruct	= &timing;
	FSMC_NORSRAMInitStructure.FSMC_WriteTimingStruct	= &timing;
	/* FSMC_NORSRAMStructInit(&FSMC_NORSRAMInitStructure); */

	FSMC_NORSRAMInit(&FSMC_NORSRAMInitStructure);

	/* Enable FSMC Bank1_SRAM Bank */
	FSMC_NORSRAMCmd(FSMC_Bank1_NORSRAM1, ENABLE);

}

#endif

#if RT_USING_STM32_FSMC

/*
 * stm32f103ve
 *
 * PERIPHERALS	MODES	REMAP	FUNCTIONS	PINS
 * FSMC_NOR_mux	Mode	0	FSMC_NOR_mux_A16	PD11
 * FSMC_NOR_mux	Mode	0	FSMC_NOR_mux_A17	PD12
 * FSMC_NOR_mux	Mode	0	FSMC_NOR_mux_A18	PD13
 * FSMC_NOR_mux	Mode	0	FSMC_NOR_mux_A19	PE3
 * FSMC_NOR_mux	Mode	0	FSMC_NOR_mux_A20	PE4
 * FSMC_NOR_mux	Mode	0	FSMC_NOR_mux_A21	PE5
 * FSMC_NOR_mux	Mode	0	FSMC_NOR_mux_A22	PE6
 * FSMC_NOR_mux	Mode	0	FSMC_NOR_mux_A23	PE2
 * FSMC_NOR_mux	Mode	0	FSMC_NOR_mux_CLK	PD3
 * FSMC_NOR_mux	Mode	0	FSMC_NOR_mux_DA0	PD14
 * FSMC_NOR_mux	Mode	0	FSMC_NOR_mux_DA1	PD15
 * FSMC_NOR_mux	Mode	0	FSMC_NOR_mux_DA10	PE13
 * FSMC_NOR_mux	Mode	0	FSMC_NOR_mux_DA11	PE14
 * FSMC_NOR_mux	Mode	0	FSMC_NOR_mux_DA12	PE15
 * FSMC_NOR_mux	Mode	0	FSMC_NOR_mux_DA13	PD8
 * FSMC_NOR_mux	Mode	0	FSMC_NOR_mux_DA14	PD9
 * FSMC_NOR_mux	Mode	0	FSMC_NOR_mux_DA15	PD10
 * FSMC_NOR_mux	Mode	0	FSMC_NOR_mux_DA2	PD0
 * FSMC_NOR_mux	Mode	0	FSMC_NOR_mux_DA3	PD1
 * FSMC_NOR_mux	Mode	0	FSMC_NOR_mux_DA4	PE7
 * FSMC_NOR_mux	Mode	0	FSMC_NOR_mux_DA5	PE8
 * FSMC_NOR_mux	Mode	0	FSMC_NOR_mux_DA6	PE9
 * FSMC_NOR_mux	Mode	0	FSMC_NOR_mux_DA7	PE10
 * FSMC_NOR_mux	Mode	0	FSMC_NOR_mux_DA8	PE11
 * FSMC_NOR_mux	Mode	0	FSMC_NOR_mux_DA9	PE12
 * FSMC_NOR_mux	Mode	0	FSMC_NOR_mux_NADV	PB7
 * FSMC_NOR_mux	Mode	0	FSMC_NOR_mux_NBL0	PE0
 * FSMC_NOR_mux	Mode	0	FSMC_NOR_mux_NBL1	PE1
 * FSMC_NOR_mux	Mode	0	FSMC_NOR_mux_NE1	PD7
 * FSMC_NOR_mux	Mode	0	FSMC_NOR_mux_NOE	PD4
 * FSMC_NOR_mux	Mode	0	FSMC_NOR_mux_NWAIT	PD6
 * FSMC_NOR_mux	Mode	0	FSMC_NOR_mux_NWE	PD5
 */
/*
 * stm32f103ze
 *
 * PERIPHERALS	MODES		REMAP	FUNCTIONS		PINS
 * FSMC_NOR_RAM	18-bit		0	FSMC_NOR_RAM_A17	PD12
 * FSMC_NOR_RAM	18-bit		0	FSMC_NOR_RAM_A0		PF0
 * FSMC_NOR_RAM	18-bit		0	FSMC_NOR_RAM_A1		PF1
 * FSMC_NOR_RAM	18-bit		0	FSMC_NOR_RAM_A2		PF2
 * FSMC_NOR_RAM	18-bit		0	FSMC_NOR_RAM_A3		PF3
 * FSMC_NOR_RAM	18-bit		0	FSMC_NOR_RAM_A4		PF4
 * FSMC_NOR_RAM	18-bit		0	FSMC_NOR_RAM_A5		PF5
 * FSMC_NOR_RAM	18-bit		0	FSMC_NOR_RAM_A6		PF12
 * FSMC_NOR_RAM	18-bit		0	FSMC_NOR_RAM_A7		PF13
 * FSMC_NOR_RAM	18-bit		0	FSMC_NOR_RAM_A8		PF14
 * FSMC_NOR_RAM	18-bit		0	FSMC_NOR_RAM_A9		PF15
 * FSMC_NOR_RAM	18-bit		0	FSMC_NOR_RAM_A10	PG0
 * FSMC_NOR_RAM	18-bit		0	FSMC_NOR_RAM_A11	PG1
 * FSMC_NOR_RAM	18-bit		0	FSMC_NOR_RAM_A12	PG2
 * FSMC_NOR_RAM	18-bit		0	FSMC_NOR_RAM_A13	PG3
 * FSMC_NOR_RAM	18-bit		0	FSMC_NOR_RAM_A14	PG4
 * FSMC_NOR_RAM	18-bit		0	FSMC_NOR_RAM_A15	PG5
 * FSMC_NOR_RAM	18-bit		0	FSMC_NOR_RAM_A16	PD11
 * FSMC_NOR_RAM	16-bit-SRAM	0	FSMC_NOR_RAM_D0		PD14
 * FSMC_NOR_RAM	16-bit-SRAM	0	FSMC_NOR_RAM_D1		PD15
 * FSMC_NOR_RAM	16-bit-SRAM	0	FSMC_NOR_RAM_D2		PD0
 * FSMC_NOR_RAM	16-bit-SRAM	0	FSMC_NOR_RAM_D3		PD1
 * FSMC_NOR_RAM	16-bit-SRAM	0	FSMC_NOR_RAM_D4		PE7
 * FSMC_NOR_RAM	16-bit-SRAM	0	FSMC_NOR_RAM_D5		PE8
 * FSMC_NOR_RAM	16-bit-SRAM	0	FSMC_NOR_RAM_D6		PE9
 * FSMC_NOR_RAM	16-bit-SRAM	0	FSMC_NOR_RAM_D7		PE10
 * FSMC_NOR_RAM	16-bit-SRAM	0	FSMC_NOR_RAM_NOE	PD4
 * FSMC_NOR_RAM	16-bit-SRAM	0	FSMC_NOR_RAM_D8		PE11
 * FSMC_NOR_RAM	16-bit-SRAM	0	FSMC_NOR_RAM_D9		PE12
 * FSMC_NOR_RAM	16-bit-SRAM	0	FSMC_NOR_RAM_D10	PE13
 * FSMC_NOR_RAM	16-bit-SRAM	0	FSMC_NOR_RAM_D11	PE14
 * FSMC_NOR_RAM	16-bit-SRAM	0	FSMC_NOR_RAM_D12	PE15
 * FSMC_NOR_RAM	16-bit-SRAM	0	FSMC_NOR_RAM_D13	PD8
 * FSMC_NOR_RAM	16-bit-SRAM	0	FSMC_NOR_RAM_D14	PD9
 * FSMC_NOR_RAM	16-bit-SRAM	0	FSMC_NOR_RAM_D15	PD10
 * FSMC_NOR_RAM	16-bit-SRAM	0	FSMC_NOR_RAM_NWE	PD5
 * FSMC_NOR_RAM	ChipSelect1	0	FSMC_NOR_RAM_NE1	PD7
 * FSMC_NOR_RAM	ByteEnable	0	FSMC_NOR_RAM_NBL0	PE0
 * FSMC_NOR_RAM	ByteEnable	0	FSMC_NOR_RAM_NBL1	PE1
 *
 *
 * PD -- 0, 1, 4, 5, 7-12, 14, 15,
 * PE -- 0, 1, 7-15,
 * PF -- 0-5,  12-15
 * PG -- 0-5,
 * */
static void fsmc_gpio_cfg(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;

	/* PD */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_4 | GPIO_Pin_5 |
	                              GPIO_Pin_7 | GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10 |
	                              GPIO_Pin_11 | GPIO_Pin_12 | GPIO_Pin_14 | GPIO_Pin_15;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_Init(GPIOD, &GPIO_InitStructure);

	/* PE */
#if 0
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_7 | GPIO_Pin_8 |
				      GPIO_Pin_9 | GPIO_Pin_10 | GPIO_Pin_11 | GPIO_Pin_12 |
				      GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;
#else
	/* #define tl16c554_1_cha_tx_en_gpio	GPIOE
	 * #define tl16c554_1_cha_tx_en_pin	GPIO_Pin_0
	 *  */
	GPIO_InitStructure.GPIO_Pin = /* GPIO_Pin_0 | */ GPIO_Pin_1 | GPIO_Pin_7 | GPIO_Pin_8 |
				      GPIO_Pin_9 | GPIO_Pin_10 | GPIO_Pin_11 | GPIO_Pin_12 |
				      GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;
#endif
	GPIO_Init(GPIOE, &GPIO_InitStructure);

