donginhb/yeejoin-workspace/light-300/rs485-sw/os-app/bsp/stm32f10x/board.c
#if RT_EXT_SRAM_MULTIPLEXED
	/* PB */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
#else
	/* PF */
	/* 3, 4, 5, 8, 9 for led-ctrl */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | /* GPIO_Pin_3 | GPIO_Pin_4 | GPIO_Pin_5 | */
	                              GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;
	GPIO_Init(GPIOF, &GPIO_InitStructure);

	/* PG */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_3 | GPIO_Pin_4 | GPIO_Pin_5;
	GPIO_Init(GPIOG, &GPIO_InitStructure);
#endif

	return;
}

static void fsmc_cfg(void)
{
	fsmc_gpio_cfg();
#if STM32_EXT_SRAM
	fsmc_for_sram_configration();
#else
	fsmc_for_tl16c554_cfg();
#endif
}
#endif

/*
 *****************************************************************************
 * 函数名       EXTI_Configuration
 * 描述           配置EXTI线
 *****************************************************************************
 */
static void exti_config(void)
{
#if RT_USING_ENC28J60
	EXTI_InitTypeDef EXTI_InitStructure;

	/* 将EXTI线连接到enc28j60'/int */
	GPIO_EXTILineConfig(ENC28J60_INT_PORT_SOURCE, ENC28J60_INT_PIN_SOURCE);
	/* 配置EXTI线上出现下降沿，则产生中断 */
	EXTI_InitStructure.EXTI_Line 	= ENC28J60_INT_EXT_LINE;
	EXTI_InitStructure.EXTI_Mode 	= EXTI_Mode_Interrupt;
	EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;
	EXTI_InitStructure.EXTI_LineCmd = ENABLE;
	EXTI_Init(&EXTI_InitStructure);
#endif

#if RT_USING_TL16C554
	EXTI_InitTypeDef EXTI_InitStructure;

	GPIO_EXTILineConfig(TL16C554_1_INT_PORT_SOURCE, TL16C554_1_INT_PIN_SOURCE);
	EXTI_InitStructure.EXTI_Line 	= TL16C554_1_INT_EXT_LINE;
	EXTI_InitStructure.EXTI_Mode 	= EXTI_Mode_Interrupt;
	EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;
	EXTI_InitStructure.EXTI_LineCmd = ENABLE;
	EXTI_Init(&EXTI_InitStructure);

	GPIO_EXTILineConfig(TL16C554_2_INT_PORT_SOURCE, TL16C554_2_INT_PIN_SOURCE);
	EXTI_InitStructure.EXTI_Line 	= TL16C554_2_INT_EXT_LINE;
	EXTI_InitStructure.EXTI_Mode 	= EXTI_Mode_Interrupt;
	EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;
	EXTI_InitStructure.EXTI_LineCmd = ENABLE;
	EXTI_Init(&EXTI_InitStructure);

#endif
	return;
}

static void spi_config(void)
{
#if RT_USING_SERIAL_FLASH || EM_ALL_TYPE_BASE
	SPI_InitTypeDef   SPI_InitStructure;
#endif
#if RT_USING_SERIAL_FLASH
	extern void spiflash_spi_cfg(void);
	spiflash_spi_cfg();
#endif

#if EM_ALL_TYPE_BASE
	/* SPI2 configuration */
	/*
	 * SPI2 clk -- APB1, fCLK1(max = 36MHz)
	 * enc28j60's clk(max) = 10MHz
	 * DS80349C.errata #1:When the SPI clock from the host microcontroller is run at frequencies of less than 8 MHz,
	 * reading or writing to the MAC registers may be unreliable.
	 */
	SPI_InitStructure.SPI_Direction 	= SPI_Direction_2Lines_FullDuplex;
	SPI_InitStructure.SPI_Mode 		= SPI_Mode_Master;
	SPI_InitStructure.SPI_DataSize 		= SPI_DataSize_8b;
	SPI_InitStructure.SPI_CPOL 		= SPI_CPOL_Low;
	SPI_InitStructure.SPI_CPHA 		= SPI_CPHA_1Edge;
	SPI_InitStructure.SPI_NSS 		= SPI_NSS_Soft;
	SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_4;
	SPI_InitStructure.SPI_FirstBit 		= SPI_FirstBit_MSB;
	SPI_InitStructure.SPI_CRCPolynomial 	= 7;
	SPI_Init(SPI2, &SPI_InitStructure);

	SPI_Cmd(SPI2, ENABLE);
#endif

	return;
}

#if 0
void delay_us(int xus)
{
	int i;

	xus *= 6;
	for (i=0; i<xus; i++)
		;

	return;
}
#endif


#if RT_USING_SERIAL_FLASH
void spiflash_spi_cfg(void)
{
	SPI_InitTypeDef   SPI_InitStructure;
#if 0
	/*
	 * SPI1 -- sst25vf016b
	 *
	 * SPI1 clk -- APB2, fCLK2(max = 72MHz)
	 */
	SPI_InitStructure.SPI_Direction 	= SPI_Direction_2Lines_FullDuplex;
	SPI_InitStructure.SPI_Mode 		= SPI_Mode_Master;
	SPI_InitStructure.SPI_DataSize 		= SPI_DataSize_8b;
	SPI_InitStructure.SPI_CPOL 		= SPI_CPOL_High;
	SPI_InitStructure.SPI_CPHA 		= SPI_CPHA_2Edge;
	SPI_InitStructure.SPI_NSS 		= SPI_NSS_Soft;
	SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_2; /* mark by David */
	SPI_InitStructure.SPI_FirstBit 		= SPI_FirstBit_MSB;
	SPI_InitStructure.SPI_CRCPolynomial 	= 7;
	SPI_Init(SPI1, &SPI_InitStructure);

	SPI_Cmd(SPI1, ENABLE);
#else
	/*
	 * wx25
	 * SPI3 clk -- APB1, fCLK1(max = 36MHz)
	 */
	SPI_InitStructure.SPI_Direction 	= SPI_Direction_2Lines_FullDuplex;
	SPI_InitStructure.SPI_Mode 		= SPI_Mode_Master;
	SPI_InitStructure.SPI_DataSize 		= SPI_DataSize_8b;
	SPI_InitStructure.SPI_CPOL 		= SPI_CPOL_Low;
	SPI_InitStructure.SPI_CPHA 		= SPI_CPHA_1Edge;
	SPI_InitStructure.SPI_NSS 		= SPI_NSS_Soft;
	SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_2;
	SPI_InitStructure.SPI_FirstBit 		= SPI_FirstBit_MSB;
	SPI_InitStructure.SPI_CRCPolynomial 	= 7;
	SPI_Init(SF_SPIX, &SPI_InitStructure);

	SPI_Cmd(SF_SPIX, ENABLE);
#endif

	return;
}
#endif

#if ENABLE_RAND
static void ADC_Configration(void)
{
	ADC_InitTypeDef ADC_InitStructure;

	RCC_ADCCLKConfig(RCC_PCLK2_Div8);

	ADC_DeInit(ADC1);
	ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
	ADC_InitStructure.ADC_ScanConvMode = DISABLE;
	ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
	ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
	ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
	ADC_InitStructure.ADC_NbrOfChannel = 1;
	ADC_Init(ADC1, &ADC_InitStructure);
	
	ADC_Cmd(ADC1, ENABLE);
	ADC_ResetCalibration(ADC1);
	while(ADC_GetResetCalibrationStatus(ADC1));
	ADC_StartCalibration(ADC1);
	while(ADC_GetCalibrationStatus(ADC1));

	ADC_TempSensorVrefintCmd(ENABLE); 
}

static void ADC_Channel_Config(void)
{
	//ADC_SampleTime_1Cycles5
	ADC_RegularChannelConfig(ADC1, ADC_Channel_16, 1, ADC_SampleTime_1Cycles5);
}

u16 Get_ADCValue(void)
{
	u16 ret;

	ADC_SoftwareStartConvCmd(ADC1, ENABLE);
	while(!ADC_GetFlagStatus(ADC1,ADC_FLAG_EOC));
	ret =  ADC_GetConversionValue(ADC1);
	return ret;
}
#endif

#if RT_USING_TL16C554
static void tl16c554_pins_cfg(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;

	GPIO_InitStructure.GPIO_Pin = tl16c554_1_csa_pin;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_Init(tl16c554_1_csa_gpio, &GPIO_InitStructure);

