donginhb/yeejoin-workspace/light-300/rs485-sw/os-app/bsp/stm32f10x/board.c
	GPIO_InitStructure.GPIO_Pin = tl16c554_1_csb_pin;
	GPIO_Init(tl16c554_1_csb_gpio, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = tl16c554_1_csc_pin;
	GPIO_Init(tl16c554_1_csc_gpio, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = tl16c554_1_csd_pin;
	GPIO_Init(tl16c554_1_csd_gpio, &GPIO_InitStructure);

	tl16c554_1_csa_deact();
	tl16c554_1_csb_deact();
	tl16c554_1_csc_deact();
	tl16c554_1_csd_deact();

	GPIO_InitStructure.GPIO_Pin = tl16c554_2_csa_pin;
	GPIO_Init(tl16c554_2_csa_gpio, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = tl16c554_2_csb_pin;
	GPIO_Init(tl16c554_2_csb_gpio, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = tl16c554_2_csc_pin;
	GPIO_Init(tl16c554_2_csc_gpio, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = tl16c554_2_csd_pin;
	GPIO_Init(tl16c554_2_csd_gpio, &GPIO_InitStructure);

	tl16c554_2_csa_deact();
	tl16c554_2_csb_deact();
	tl16c554_2_csc_deact();
	tl16c554_2_csd_deact();

	GPIO_InitStructure.GPIO_Pin = tl16c554_1_reset_pin;
	GPIO_Init(tl16c554_1_reset_gpio, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = tl16c554_2_reset_pin;
	GPIO_Init(tl16c554_2_reset_gpio, &GPIO_InitStructure);

	tl16c554_1_reset_act();
	tl16c554_2_reset_act();

	/* 485 tx_en, rx_en pin cfg */
	GPIO_InitStructure.GPIO_Pin = tl16c554_x_chx_rx_en_pin;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_Init(tl16c554_x_chx_rx_en_gpio, &GPIO_InitStructure);

	tl16c554_x_485rx_enable();

	GPIO_InitStructure.GPIO_Pin = tl16c554_1_cha_tx_en_pin;
	GPIO_Init(tl16c554_1_cha_tx_en_gpio, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = tl16c554_1_chb_tx_en_pin;
	GPIO_Init(tl16c554_1_chb_tx_en_gpio, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = tl16c554_1_chc_tx_en_pin;
	GPIO_Init(tl16c554_1_chc_tx_en_gpio, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = tl16c554_1_chd_tx_en_pin;
	GPIO_Init(tl16c554_1_chd_tx_en_gpio, &GPIO_InitStructure);

	tl16c554_1_cha_485tx_disable();
	tl16c554_1_chb_485tx_disable();
	tl16c554_1_chc_485tx_disable();
	tl16c554_1_chd_485tx_disable();

	GPIO_InitStructure.GPIO_Pin = tl16c554_2_cha_tx_en_pin;
	GPIO_Init(tl16c554_2_cha_tx_en_gpio, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = tl16c554_2_chb_tx_en_pin;
	GPIO_Init(tl16c554_2_chb_tx_en_gpio, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = tl16c554_2_chc_tx_en_pin;
	GPIO_Init(tl16c554_2_chc_tx_en_gpio, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = tl16c554_2_chd_tx_en_pin;
	GPIO_Init(tl16c554_2_chd_tx_en_gpio, &GPIO_InitStructure);

	tl16c554_2_cha_485tx_disable();
	tl16c554_2_chb_485tx_disable();
	tl16c554_2_chc_485tx_disable();
	tl16c554_2_chd_485tx_disable();

	GPIO_InitStructure.GPIO_Pin 	= tl16c554_1_intx_pin;
	GPIO_InitStructure.GPIO_Speed 	= GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode 	= GPIO_Mode_IPD;
	GPIO_Init(tl16c554_1_intx_gpio, &GPIO_InitStructure);

	GPIO_InitStructure.GPIO_Pin 	= tl16c554_2_intx_pin;
	GPIO_Init(tl16c554_2_intx_gpio, &GPIO_InitStructure);
}
#endif

/*@}*/


